# 1- Pandas

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd

## Pandas Serisi Olusturmak

In [3]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [4]:
seri = pd.Series([10,88,3,4,5])

In [5]:
type(seri)

pandas.core.series.Series

In [6]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [8]:
seri.ndim

1

In [9]:
seri.values

array([10, 88,  3,  4,  5])

In [10]:
seri.head(3)

0    10
1    88
2     3
dtype: int64

In [11]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [12]:
seri = pd.Series([99,22,332,94,5],index = ['a','b','c','d','e'])

In [13]:
seri['a']

99

In [14]:
seri['a':'c']

a     99
b     22
c    332
dtype: int64

* sözlük üzerinden liste olusturmak

In [15]:
sozluk = {'reg':10, 
          'log':11, 
          'cart':12}
sozluk = pd.Series(sozluk)
sozluk

reg     10
log     11
cart    12
dtype: int64

* iki seriyi birlestirmek

In [16]:
pd.concat([seri,seri])

a     99
b     22
c    332
d     94
e      5
a     99
b     22
c    332
d     94
e      5
dtype: int64

## Eleman Islemleri

In [17]:
import numpy as np

In [18]:
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [19]:
seri[0:3]

0     1
1     2
2    33
dtype: int64

In [20]:
seri = pd.Series([121,200,150,99],index = ['reg','loj','cart','rf'])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [21]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [22]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [23]:
seri.items()

In [24]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [25]:
seri.values

array([121, 200, 150,  99])

In [26]:
#eleman sorgulama 
'reg' in seri

True

In [27]:
#fancy eleman secimi
seri[['rf','reg']]

rf      99
reg    121
dtype: int64

In [28]:
#eleman atama
seri['reg'] = 130
seri['reg']

130

## DataFrame Olusturma

In [29]:
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [30]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [31]:
df = pd.DataFrame(m, columns = ['var1','var2','var3'])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [34]:
df.shape

(3, 3)

In [35]:
df.ndim

2

In [36]:
df.size

9

In [37]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

* eleman islemleri devam

In [38]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [39]:
sozluk = {'var1': s1, 
          'var2': s2, 
          'var3': s3}
sozluk

{'var1': array([1, 4, 4, 2, 8]),
 'var2': array([4, 9, 1, 1, 9]),
 'var3': array([6, 7, 0, 2, 4])}

In [40]:
df = pd.DataFrame(sozluk) 
df[0:1]

   var1  var2  var3
0     1     4     6

In [41]:
df.index = ['a','b','c','d','e']
df

   var1  var2  var3
a     1     4     6
b     4     9     7
c     4     1     0
d     2     1     2
e     8     9     4

In [42]:
df.drop('a', axis = 0)      #silme islemi kopya üzerinde uygulanir

   var1  var2  var3
b     4     9     7
c     4     1     0
d     2     1     2
e     8     9     4

In [43]:
df.drop('a', axis = 0 , inplace = True)     # silme islemi veri setini etkiler
df

   var1  var2  var3
b     4     9     7
c     4     1     0
d     2     1     2
e     8     9     4

In [44]:
# fancy teknigi ile silme (satir bazinda)
l = ['c','e']
df.drop(l, axis = 0)

   var1  var2  var3
b     4     9     7
d     2     1     2

* Degiskenler (sütunlar) icin islemler;

In [45]:
df

   var1  var2  var3
b     4     9     7
c     4     1     0
d     2     1     2
e     8     9     4

In [46]:
'var1' in df

True

In [47]:
l = ['var1', 'var4', 'var2']

In [48]:
for i in l:
    print(i in df)

True
False
True

In [49]:
df['var4'] = df['var1'] / df['var2']    # var4 adinda yeni bir sütun olusturduk
df

   var1  var2  var3      var4
b     4     9     7  0.444444
c     4     1     0  4.000000
d     2     1     2  2.000000
e     8     9     4  0.888889

In [50]:
df.drop('var4', axis = 1)    # sütun bazinda silme islemi, veri setini etkilemez

   var1  var2  var3
b     4     9     7
c     4     1     0
d     2     1     2
e     8     9     4

In [51]:
df

   var1  var2  var3      var4
b     4     9     7  0.444444
c     4     1     0  4.000000
d     2     1     2  2.000000
e     8     9     4  0.888889

In [52]:
df.drop('var4', axis = 1, inplace = True)
df

   var1  var2  var3
b     4     9     7
c     4     1     0
d     2     1     2
e     8     9     4

In [53]:
# facy teknigi ile silme
l = ['var1','var2']
df.drop(l, axis = 1)

   var3
b     7
c     0
d     2
e     4

## loc & iloc

In [54]:
m = np.random.randint(1,30 , size = (10,3))
df = pd.DataFrame(m, columns = ['var1','var2','var3'])
df

   var1  var2  var3
0    14    11    29
1    28     2    27
2    27    11    10
3    14    29    10
4     6    12     1
5     4    17     4
6    28    14    16
7    21    13    25
8    25    16     2
9     1    21    17

In [55]:
df.loc[0:3]

   var1  var2  var3
0    14    11    29
1    28     2    27
2    27    11    10
3    14    29    10

In [56]:
df.iloc[0:3]

   var1  var2  var3
0    14    11    29
1    28     2    27
2    27    11    10

In [57]:
df.iloc[:3,:2]

   var1  var2
0    14    11
1    28     2
2    27    11

In [58]:
df.iloc[0:3]['var3']

0    29
1    27
2    10
Name: var3, dtype: int64

## Kosullu Eleman Islemleri

In [59]:
m = np.random.randint(1,30 , size = (10,3))
df = pd.DataFrame(m, columns = ['var1','var2','var3'])
df

   var1  var2  var3
0    24     4     3
1     1     5    12
2    22    15    12
3    17     5    28
4    19     7    24
5     8    25    14
6    15     7     9
7     1     1    22
8    11    14    14
9    16    10    10

In [60]:
df['var1']

0    24
1     1
2    22
3    17
4    19
5     8
6    15
7     1
8    11
9    16
Name: var1, dtype: int64

In [61]:
df['var1'][0:2]

0    24
1     1
Name: var1, dtype: int64

In [62]:
df[(df.var1 > 5) & (df.var1 < 15)]   #kosullu secim

   var1  var2  var3
5     8    25    14
8    11    14    14

In [63]:
df[(df.var1 > 5)][['var1','var2']]   #kosullu secim + fancy

   var1  var2
0    24     4
2    22    15
3    17     5
4    19     7
5     8    25
6    15     7
8    11    14
9    16    10

## DataFrame Birlestirme (Join) islemleri

In [64]:
m = np.random.randint(1,30 , size = (5,3))
df1 = pd.DataFrame(m, columns = ['var1','var2','var3'])
df1

   var1  var2  var3
0     9    12    22
1     5    20    18
2    23    12    19
3    26    26    24
4     8    14    12

In [65]:
df2 = df1 + 99
df2

   var1  var2  var3
0   108   111   121
1   104   119   117
2   122   111   118
3   125   125   123
4   107   113   111

In [66]:
pd.concat([df1,df2], ignore_index = True)     # 'ignore_index'; index numaralarini düzenler

   var1  var2  var3
0     9    12    22
1     5    20    18
2    23    12    19
3    26    26    24
4     8    14    12
5   108   111   121
6   104   119   117
7   122   111   118
8   125   125   123
9   107   113   111

* Ileri Birlestirme Islemleri

In [67]:
#Birebir Birlestirme 
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'IK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [68]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [69]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [70]:
df4 = pd.DataFrame({'grup' : ['Muhasebe', 'Muhendislik', 'IK'],
                    'mudur' : ['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [71]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [72]:
df5 = pd.DataFrame({'grup': ['Muhasebe','Muhasebe','Muhendislik','Muhendislik','IK','IK'],
                    'yetenekler': ['matemaatik','excel','kodlama','linux','excel','yonetim']})
df5

          grup  yetenekler
0     Muhasebe  matemaatik
1     Muhasebe       excel
2  Muhendislik     kodlama
3  Muhendislik       linux
4           IK       excel
5           IK     yonetim

In [73]:
pd.merge(df1,df5)

  calisanlar         grup  yetenekler
0        Ali     Muhasebe  matemaatik
1        Ali     Muhasebe       excel
2       Veli  Muhendislik     kodlama
3       Veli  Muhendislik       linux
4       Ayse  Muhendislik     kodlama
5       Ayse  Muhendislik       linux
6      Fatma           IK       excel
7      Fatma           IK     yonetim

## Toplulastirma ve Gruplama (Aggregation & Grouping)

Basit Toplulastirma Fonksiyonlari 
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [74]:
import seaborn as sns

In [75]:
df = sns.load_dataset('planets')
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [76]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [77]:
df.shape

(1035, 6)

In [78]:
# Sayısal sütunları seçin
df = df.select_dtypes(include=['float64', 'int64'])
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [79]:
df['mass'].mean()

2.6381605847953216

In [80]:
df['mass'].count()

513

In [81]:
df['mass'].min()

0.0036

In [82]:
df['mass'].max()

25.0

In [83]:
df['mass'].sum()

1353.37638

In [84]:
df['mass'].std()

3.8186166509616046

In [85]:
df['mass'].var()

14.58183312700122

In [86]:
df.describe() # --> Betimsel Istatistik

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [87]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [88]:
df.dropna().describe().T  # eksik verileri cikararak her bir sayısal sütun için istatistiksel bir özet oluşturur.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# 2- GRUPLAMA ISLEMLERI

In [89]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'veri': [10,11,52,23,43,55]}, 
                  columns = ['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [90]:
df.groupby('gruplar')     # Cikti cikmaz. Bir fonksiyonla desteklemek gerekir

In [91]:
df.groupby('gruplar').mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [92]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [93]:
df = sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [94]:
df.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [95]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# 3- ILERI TOPLULASTIRMA ISLEMLERI (Aggregate, Filter, Transform, Apply)

In [96]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [97]:
df.groupby('gruplar').mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [98]:
df.groupby('gruplar').aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [99]:
df.groupby('gruplar').aggregate({'degisken1': 'min', 'degisken2': 'max'})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

* Filter

In [100]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [101]:
def filter_func(x):
    return x['degisken1'].std() > 9

In [102]:
df.groupby('gruplar').std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [103]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

* Transform

In [104]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [105]:
df['degisken1']*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [106]:
df_a = df.iloc[:,1:3]
df_a.transform(lambda x: (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

* Apply

In [107]:
df = pd.DataFrame({
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0     NaN         10        100
1     NaN         23        253
2     NaN         33        333
3     NaN         22        262
4     NaN         11        111
5     NaN         99        969

In [108]:
df.apply(np.sum)

gruplar         0
degisken1     198
degisken2    2028
dtype: int64

In [109]:
df.apply(np.mean)

gruplar        NaN
degisken1     33.0
degisken2    338.0
dtype: float64

In [110]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])

In [111]:
df.groupby('gruplar').apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

# 4- PIVOT TABLOLAR

In [112]:
import pandas as pd
import seaborn as sns

In [113]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [114]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [115]:
titanic.groupby(['sex', 'class'], observed=False)[['survived']].mean().unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [116]:
titanic.pivot_table('survived', index = 'sex', columns = 'class', observed= False)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [117]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [118]:
age = pd.cut(titanic['age'],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [119]:
titanic.pivot_table('survived', ['sex', age], 'class', observed=False)

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663